[
  {
    "key": "adaptive",
    "start": "April 2023",
    "start_fr": "Avril 2023",
    "end": "Today",
    "end_fr": "Aujourd'hui",
    "title": "Full Stack Developer",
    "title_fr": "Développeur Full Stack",
    "subtitle": "Adaptive Inc., Montreal, QC",
    "subtitle_fr": "Adaptive Inc., Montreal, QC",
    "description": "⚫️ Participating in the design and implementation of a sophisticated trading platform as a flagship project. <b>Skills</b>: <em>ReactJS, Storybook, Redux, Typescript, API, Unit Testing.</em><br/>⚫️ Investing in my professional growth by undergoing intensive training in the Java language and its associated environments. <b>Skills</b>: <em>Java Spring Boot, Gradle.</em>",
    "description_fr": "⚫️ Participer à la conception et la mise en œuvre d'une plateforme de trading complexe en tant que projet phare. <b>Compétences</b>: <em>ReactJS, Storybook, Redux, Typescript, API, Unit Testing.</em><br/>⚫️ Investir dans ma croissance professionnelle en me formant intensivement sur le langage Java et ses environnements. <b>Compétences</b> : <em>Java Spring Boot, Gradle.</em>"
  },
  {
    "key": "esokia",
    "start": "March 2021",
    "start_fr": "Mars 2021",
    "end": "March 2023",
    "end_fr": "Mars 2023",
    "title": "ReactJS Developer",
    "title_fr": "Développeur ReactJS",
    "subtitle": "Esokia, Madagascar",
    "subtitle_fr": "Esokia, Madagascar",
    "description": "⚫️ Leading the comprehensive redesign of a hotel website, transitioning from Drupal (PHP) to NextJS. <b>Skills</b>: <em>NextJS, API, Unit Testing, Optimization.</em><br/>⚫️ Actively contributed to the development of an innovative feature enabling passport digitization for user identification within a mobile application, powered by Artificial Intelligence to extract user information. <b>Skills</b>: <em>ReactJS, TypeScript, Redux, JWT.</em><br/>⚫️ Designing and implementing a critical web documentation page for the modification of internal website structures. <b>Skills</b>: <em>ReactJS, SASS, Static Deployment.</em><br/>⚫️ Successfully creating and integrating diverse themes for multiple markets within a Sitecore-based website. <b>Skills</b>: <em>SASS, HTML, JavaScript, Gulp, CI/CD.</em><br/>⚫️ Responsible for integrating a Figma design mock-up into a Magento theme, ensuring a seamless alignment between design and implementation. <b>Skills</b>: <em>SASS, HTML, JavaScript.</em><br/>⚫️ Ensured proactive maintenance of a widget handling user logins, registrations, and password resets, ensuring a seamless user experience. <b>Skills</b>: <em>VueJS.</em><br/>⚫️ Collaborated effectively within a 15-member Agile team, utilizing Azure DevOps for task management and Git flow for seamless code collaboration.",
    "description_fr": "⚫️ Pilotage de la refonte complète d'un site Web hôtelier, avec une transition de Drupal (PHP) à NextJS. <b>Compétences</b>: <em>NextJS, API, Unit Testing, Optimisation ReactJS.</em><br/>⚫️ Contribué activement au développement d'une fonctionnalité innovante permettant la numérisation de passeports pour s'identifier à une application mobile; alimentée pas une Intelligence Artificielle pour extraire les informations de l'utilisateur. <b>Compétences</b> : <em>ReactJS, TypeScript, Redux, JWT.</em><br/>⚫️ Conception et mise en place d'une page Web de documentation cruciale pour la modification des structures de sites Web internes. <b>Compétences</b> : <em>ReactJS, SASS, Déploiement statique.</em><br/>⚫️ Création et intégration réussie de thèmes variés pour plusieurs marchés, au sein d'un site Web basé sur Sitecore. <b>Compétences</b>: <em>SASS, HTML, JavaScript, Gulp, CI/CD.</em><br/>⚫️ Prise en charge de l'intégration d'une maquette Figma sur thème Magento, garantissant une correspondance parfaite entre la conception et le rendu. <b>Compétences</b> : <em>SASS, HTML, JavaScript.</em><br/>⚫️ Assuré la maintenance proactive d'un widget gérant les connexions, inscriptions et réinitialisations de mot de passe des utilisateurs, garantissant une expérience fluide. <b>Compétences</b>: <em>VueJS.</em><br/>⚫️ Collaboré efficacement au sein d'une équipe Agile composée de 15 membres, en utilisant Azure DevOps pour la gestion des tâches et Git flow pour une collaboration de code harmonieuse."
  },
  {
    "key": "ingenosya",
    "start": "July 2019",
    "start_fr": "Jullet 2019",
    "end": "March 2021",
    "end_fr": "Mars 2021",
    "title": "Web Developer",
    "title_fr": "Développeur Web",
    "subtitle": "Ingenosya, Madagascar",
    "subtitle_fr": "Ingenosya, Madagascar",
    "description": "⚫️ Led the development of an advanced administration page in ReactJS, efficiently managing advertisements integrated into videos while generating crucial metrics to evaluate the impact of company-advertised content. <b>Skills</b>: <em>ReactJS, TypeScript, Redux, NodeJS, MongoDB, Redis, Unit Testing, CI/CD Development, Agile System.</em><br/>⚫️ Ensured proactive maintenance and functional expansion of multiple websites, addressing specific needs and client requests. <b>Skills</b>: <em>PHP, MySQL, HTML, CSS, JavaScript, FTP, SSH.</em><br/>⚫️ Ensured the sustainability of a proprietary Framework tailored for the client, facilitating the creation of new websites in alignment with company themes and policies. <b>Skills</b>: <em>PHP, MySQL, SSH.</em><br/>⚫️ Designed and executed an advanced database update script for a real estate advertising website. <b>Skills</b>: <em>PHP, MySQL, SSH, Crontab.</em><br/>⚫️ Complete development of a web and mobile messaging application, engaging users visiting a website. <b>Skills</b>: <em>JavaScript, PHP, MySQL, Swift, WebView.</em>",
    "description_fr": "⚫️ Conduite du développement d'une page d'administration élaborée en ReactJS, gérant efficacement les publicités intégrées aux vidéos tout en générant des métriques cruciales pour évaluer l'impact des publicités diffusées par l'entreprise. <b>Compétences</b> : <em>ReactJS, TypeScript, Redux, NodeJS, MongoDB, Redis, Tests unitaires, Développement CI/CD, Développement Agile.</em><br/>⚫️ Assuré la maintenance proactive et l'expansion fonctionnelle de multiples sites web, en répondant aux besoins et aux demandes spécifiques des clients. <b>Compétences</b>: <em>PHP, MySQL, HTML, CSS, JavaScript, FTP, SSH.</em><br/>⚫️ Garantie de la pérennité d'un Framework propriétaire destiné au client, facilitant la création de nouveaux sites en accord avec les thèmes et la politique de l'entreprise. <b>Compétences</b>: <em>PHP, MySQL, SSH.</em><br/>⚫️ Conception et exécution d'un script avancé de mise à jour de bases de données destiné à un site de publicité immobilière. <b>Compétences</b>: <em>PHP, MySQL, SSH, Crontab.</em><br/>⚫️ Réalisation complète d'une application web et mobile de messagerie, permettant d'interpeller les utilisateurs visitant un site web. <b>Compétences</b>: <em>JavaScript, PHP, MySQL, Swift, WebView.</em>"
  },
  {
    "key": "freelance",
    "start": "April 2015",
    "start_fr": "Avril 2015",
    "end": "June 2020",
    "end_fr": "Juin 2020",
    "title": "Full Stack Developer",
    "title_fr": "Développeur Full Stack",
    "subtitle": "Freelance",
    "subtitle_fr": "Freelance",
    "description": "⚫️ Directed the design and development of several customized websites for a variety of clients and industries. As an individual contributor to the majority of projects, I also assumed the role of team leader, overseeing a team of three individuals during complex projects. <b>Skills</b>: <em>ReactJS, TypeScript, VueJS, NuxtJS, HTML5, SASS, CSS3, PHP, MySQL, MongoDB, NodeJS, ExpressJS, JWT Auth, Auth0, AWS, DevOps, CI/CD, Unit testing.</em><br/>⚫️ Successful creation of hybrid mobile applications using <em>React Native</em>, delivering optimal user experiences across a variety of platforms.<br/>⚫️ Accomplishment of an innovative web form with an \"offline first\" approach, utilizing <em>Progressive Web App (PWA)</em> technology. This enables users to access and fill out the form in offline mode, ensuring a seamless and intuitive user experience even without an internet connection.",
    "description_fr": "⚫️ Dirigé la conception et le développement de plusieurs sites web personnalisés pour une diversité de clients et de secteurs. En tant que contributeur individuel à la majorité des projets, j'ai également assumé le rôle de chef d'équipe, encadrant une équipe de trois personnes lors de projets complexes. <b>Compétences</b>: <em>AWS, ReactJS, TypeScript, VueJS, NextJS, AngularJS, SASS, PHP, MySQL, MongoDB, NodeJS, ExpressJS, JWT Auth, Auth0, DevOps, CI/CD, Unit Testing.</em><br/>⚫️ Conception aboutie d'applications mobiles hybrides grâce à <em>React Native</em>, offrant des expériences utilisateur optimales sur une variété de plateformes.<br/>⚫️ Réalisation d'un formulaire web innovant avec une approche \"offline first\", en utilisant la technologie <em>Progressive Web App (PWA)</em>; permettant aux utilisateurs d'accéder et de remplir le formulaire en mode hors ligne, garantissant ainsi une expérience utilisateur ininterrompue et intuitive."
  },
  {
    "key": "ruanko",
    "start": "Nov. 2016",
    "start_fr": "Nov. 2016",
    "end": "Jan. 2017",
    "end_fr": "Jan. 2017",
    "title": "Web Developer Internship",
    "title_fr": "Stage Développeur Web",
    "subtitle": "Ruanko Company, China",
    "subtitle_fr": "Ruanko Company, Chine",
    "description": "⚫️ Played a pivotal role in the proactive maintenance of a high-traffic e-commerce website, attracting over 2000 users per day. I gained an in-depth understanding of server performance management to ensure an optimal experience for the large user base. <b>Skills</b>: <em>Java EE, CSS, JavaScript, Bash.</em><br/>⚫️ Enhanced the visual appeal and user experience (UI/UX) of a website, thereby improving overall attractiveness and user-friendliness. <b>Skills</b>: <em>CSS, HTML, JavaScript.</em><br/>⚫️ Successfully created an engaging product demo page, showcasing the features and appeal of a specific product. <b>Skills</b>: <em>HTML, CSS, JavaScript.</em>",
    "description_fr": "⚫️ Joué un rôle clé dans la maintenance proactive d'un site e-commerce à fort trafic, attirant plus de 2000 utilisateurs par jour. J'ai acquis une compréhension approfondie de la gestion des performances du serveur pour assurer une expérience optimale aux nombreux utilisateurs. <b>Compétences</b> : <em>Java EE, CSS, JavaScript, Bash, Apache.</em><br/>⚫️ Perfectionné l'aspect visuel et l'expérience utilisateur (UI/UX) d'un site web, améliorant ainsi l'attrait et la convivialité globale. <b>Compétences</b> : <em>CSS, HTML, JavaScript.</em><br/>⚫️ Réalisation réussie d'une page de démonstration produit captivante, mettant en valeur les fonctionnalités et l'attrait d'un produit spécifique. <b>Compétences</b> : <em>HTML, CSS, JavaScript.</em>"
  },
  {
    "key": "gnlaser",
    "start": "March 2016",
    "start_fr": "Mars 2016",
    "end": "April 2017",
    "end_fr": "Avril 2017",
    "title": "Full Stack Developer",
    "title_fr": "Développeur Full Stack",
    "subtitle": "Wuhan GNLaser Manufacturer, China",
    "subtitle_fr": "Wuhan GNLaser Manufacturer, Chine",
    "description": "⚫️ Led the design of an English version of the company's website, aiming to provide an optimal experience for their international customers. <b>Skills</b>: <em>PHP, HTML, CSS, JavaScript, MySQL.</em><br/>⚫️ Engaged in meticulous optimization of the website's HTML tags, aiming to enhance web <em>search engine optimization (SEO)</em>. This strategic initiative was undertaken to maximize the company's reach and relevance on search engines.",
    "description_fr": "⚫️ Pilotage de la conception d'une version anglaise du site web de l'entreprise, visant à offrir une expérience optimale à leurs clients internationaux. <b>Compétences</b> : <em>PHP, CSS, JavaScript, MySQL.</em><br/>⚫️ Engagé dans une optimisation minutieuse des balises HTML du site, visant à renforcer le <em>référencement web (SEO)</em>. Cette démarche stratégique a été entreprise pour maximiser la portée et la pertinence de la compagnie sur les moteurs de recherche."
  },
  {
    "key": "acbg",
    "start": "Feb. 2016",
    "start_fr": "Fev. 2016",
    "end": "March 2018",
    "end_fr": "Mars 2018",
    "title": "Full Stack Developer",
    "title_fr": "Développeur Full Stack",
    "subtitle": "Africa-China Business Group, China",
    "subtitle_fr": "Africa-China Business Group, Chine",
    "description": "⚫️ Completed the comprehensive design of a website enticing African students to pursue their studies in China, highlighting the benefits of this educational experience. <b>Skills</b>: <em>PHP, JavaScript, MySQL.</em><br/>⚫️ Developed a customized mini-<em>Enterprise Resource Planning (ERP)</em> system to efficiently record and track activities within the Africa-China Business Group, contributing to optimal operational management.",
    "description_fr": "⚫️ Réalisé la conception complète d'un site web invitant les étudiants africains à poursuivre leurs études enChine,mettantenlumièrelesavantagesdecetteexpérienceéducative. <b>Compétences</b>:<em>PHP, HTML, CSS, JavaScript, MySQL.</em><br/>⚫️ Créé un mini-système d'<em>ERP (Enterprise Resource Planning)</em> sur mesure pour enregistrer et suivre efficacement les activités du groupe Africa-China Business Group, contribuant ainsi à une gestion optimale des opérations."
  },
  {
    "key": "men",
    "start": "Feb. 2012",
    "start_fr": "Fev. 2012",
    "end": "May 2012",
    "end_fr": "Mai 2012",
    "title": "Software Engineer Internship",
    "title_fr": "Stage Ingénieur Développeur",
    "subtitle": "Minister of National Education, Madagascar",
    "subtitle_fr": "Ministère de l'Éducation Nationale, Madagascar",
    "description": "⚫️ Conceptualization and creation of an innovative software prototype designed to automate the management of school sports activities, enabling computerized tracking of sports events. <b>Skills</b>: <em>Python, SQLite.</em>",
    "description_fr": "⚫️ Conceptualisation et réalisation d'un prototype logiciel novateur destiné à automatiser la gestion des activités sportives scolaires, permettant ainsi une traçabilité informatisée des événements sportifs. <b>Compétences</b> : <em>Python, SQLite.</em>"
  }
]
