[
  {
    "start": "March 2021",
    "start_fr": "Mars 2021",
    "end": "Today",
    "end_fr": "Aujourd'hui",
    "title": "Frontend Developer",
    "title_fr": "Développeur Frontend",
    "subtitle": "Esokia, Madagascar",
    "subtitle_fr": "Esokia, Madagascar",
    "description": "- Creation and integration of different themes for several markets using a website developed under Sitecore. <b>Technology used</b>: <em>SASS</em>, <em>HTML</em>, <em>JavaScript</em>, <em>Gulp</em>.</br>- Responsible for the integration of a Figma mock-up on a website using Magento. <b>Technology used</b>: <em>SASS</em>, <em>HTML</em>, <em>JavaScript</em>.</br>- Maintenance of a widget that manages user logins, registrations and password changes. <b>Technology used</b>: <em>VueJS</em>.</br>- Work in Agile mode within a team of 15 people, using the <em>Azure DevOps</em> tool to organize tasks and Git for codes.",
    "description_fr": "- Création et intégration de différents thèmes pour plusieurs marchés utilisant un site web développé sous Sitecore. <b>Technologie utilisée</b> : <em>SASS</em>, <em>HTML</em>, <em>JavaScript</em>, <em>Gulp</em>.</br>- Responsable de l’intégration d’une maquette Figma sur un site web utilisant Magento. <b>Technologie utilisée</b> : <em>SASS</em>, <em>HTML</em>, <em>JavaScript</em>.</br>- Maintenance d’un widget qui gère les connexions d’utilisateur, les inscriptions et les changements de mots de passes. <b>Technologie utilisée</b> : <em>VueJS</em>.</br>- Travail en mode Agile au sein d’une équipe composé de 15 personnes, en utilisant l’outil <em>Azure DevOps</em> pour organiser les taches et Git pour les codes."
  },
  {
    "start": "July 2019",
    "start_fr": "Jullet 2019",
    "end": "March 2021",
    "end_fr": "Mars 2021",
    "title": "Web Developer",
    "title_fr": "Développeur Web",
    "subtitle": "Ingenosya, Madagascar",
    "subtitle_fr": "Ingenosya, Madagascar",
    "description": "- Maintenance of several websites and addition of new functionalities according to customer demand. <b>Technology used</b>: <em>PHP</em>, <em>MySQL</em>, <em>HTML</em>, <em>CSS</em>, <em>JavaScript</em>, <em>FTP</em>.</br>- Maintenance of a proprietary framework for the client that helps them create new websites easily according to the company’s themes and policies. <b>Technology used</b>: <em>PHP</em>, <em>MySQL</em>.</br>- Creation of a script to update the database for a real estate advertising website. <b>Technology used</b>: <em>PHP</em>, <em>MySQL</em>, <em>SSH</em>, <em>Crontab</em>.</br>- Creation of a web and mobile Chat application to engage users who visit a website. <b>Technology used</b>: <em>JavaScript</em>, <em>PHP</em>, <em>MySQL</em>, <em>Swift</em>, <em>WebView</em>.",
    "description_fr": "- Maintenance de plusieurs sites web et ajout de nouvelles fonctionnalités selon la demande des clients. <b>Technologie utilisée</b> : <em>PHP</em>, <em>MySQL</em>, <em>HTML</em>, <em>CSS</em>, <em>JavaScript</em>, <em>FTP</em>.</br>- Maintenance d’un Framework propriétaire au client qui leur aide à créer de nouveaux sites plus facilement et en suivant les thèmes et politique de la compagnie. <b>Technologie utilisée</b> : <em>PHP</em>, <em>MySQL</em>.</br>- Création de script de mise à jour des bases de données pour un site de publicité immobilier. <b>Technologie utilisée</b> : <em>PHP</em>, <em>MySQL</em>, <em>SSH</em>, <em>Crontab</em>.</br>- Création d’une application web et mobile de « Chat » pour int<em>ERP</em>eller les utilisateurs qui visitent un site web. <b>Technologie utilisée</b> : <em>JavaScript</em>, <em>PHP</em>, <em>MySQL</em>, <em>Swift</em>, <em>WebView</em>."
  },
  {
    "start": "April 2015",
    "start_fr": "Avril 2015",
    "end": "Today",
    "end_fr": "Aujourd'hui",
    "title": "Full Stack Developer",
    "title_fr": "Développeur Full Stack",
    "subtitle": "Freelance",
    "subtitle_fr": "Freelance",
    "description": "- Design of several websites for different clients in different fields. <b>Technology used</b>: <em>ReactJS</em>, <em>VueJS</em>, <em>HTML</em>, <em>SASS</em>, <em>CSS</em>, <em>PHP</em>, <em>MySQL</em>, <em>MongoDB</em>, <em>NodeJS</em>, <em>ExpressJS</em>.</br>- Creation of hybrid mobile applications with <em>React Native</em>.</br>- Creation of an '<em>offline first</em>' web form using '<em>Service Workers</em>'.",
    "description_fr": "- Conception de plusieurs sites web pour différents clients dans différents domaines. <b>Technologie utilisée</b> : <em>ReactJS</em>, <em>VueJS</em>, <em>HTML</em>, <em>SASS</em>, <em>CSS</em>, <em>PHP</em>, <em>MySQL</em>, <em>MongoDB</em>, <em>NodeJS</em>, <em>ExpressJS</em>.</br>- La conception d’application mobile hybride avec <em>React Native</em>.</br>- Création d’un formulaire web « <em>offline first</em> » en utilisant les « <em>Service Workers</em> »."
  },
  {
    "start": "Nov. 2016",
    "start_fr": "Nov. 2016",
    "end": "Jan. 2017",
    "end_fr": "Jan. 2017",
    "title": "Web Developer Internship",
    "title_fr": "Stage Développeur Web",
    "subtitle": "Ruanko Company, China",
    "subtitle_fr": "Ruanko Company, Chine",
    "description": "- Participation in the maintenance of an e-commerce site which attracts more than 2000 users per day. <b>Technology used</b>: <em>Java</em>, <em>CSS</em>.</br>- Optimization of the graphic aspects (UI and UX) of the website. <b>Technology used</b>: <em>CSS</em>, <em>JavaScript</em>.</br>- Creation of a demo product page. <b>Technology used</b>: <em>HTML</em>, <em>CSS</em>, <em>JavaScript</em>.",
    "description_fr": "- Participation à la maintenance d’un site e-commerce qui attire plus de 2000 utilisateurs par jour. <b>Technologie utilisée</b> : <em>Java</em>, <em>CSS</em>.</br>- Optimisation des aspects graphiques (UI et UX) du site. <b>Technologie utilisée</b> : <em>CSS</em>, <em>JavaScript</em>.</br>- Création d’une page de produit de démo. <b>Technologie utilisée</b> : <em>HTML</em>, <em>CSS</em>, <em>JavaScript</em>."
  },
  {
    "start": "March 2016",
    "start_fr": "Mars 2016",
    "end": "April 2017",
    "end_fr": "Avril 2017",
    "title": "Full Stack Developer",
    "title_fr": "Développeur Full Stack",
    "subtitle": "Wuhan GNLaser Manufacturer, China",
    "subtitle_fr": "Wuhan GNLaser Manufacturer, Chine",
    "description": "- Design of an English version website for the company’s Chinese website to target international market. <b>Technology used</b>: <em>PHP</em>, <em>HTML</em>, <em>CSS</em>, <em>JavaScript</em>, <em>MySQL</em>.</br>- Optimization of the website's <em>HTML</em> tags to have more points for SEO purposes in order to increase the visibility of the company.",
    "description_fr": "- Conception d’un site web version anglais pour la compagnie pour leurs clients internationaux. <b>Technologie utilisée</b> : <em>PHP</em>, <em>HTML</em>, <em>CSS</em>, <em>JavaScript</em>, <em>MySQL</em>.</br>- Optimisation des balises <em>HTML</em> du site pour avoir plus de points pour le SEO (référencement web) afin d’augmenter la visibilité de la compagnie."
  },
  {
    "start": "Feb. 2016",
    "start_fr": "Fev. 2016",
    "end": "March 2018",
    "end_fr": "Mars 2018",
    "title": "Full Stack Developer",
    "title_fr": "Développeur Full Stack",
    "subtitle": "Africa-China Business Group, China",
    "subtitle_fr": "Africa-China Business Group, Chine",
    "description": "- Member and head of the technical department of the Africa-China Business Group.</br>- Development of a web application for customers to register and participate in the various events created by the group. <b>Technology used</b>: <em>PHP</em>, <em>HTML</em>, <em>CSS</em>, <em>JavaScript</em>, <em>MySQL</em>.</br>- Development of a website to attract African Students to go study in China. <b>Technology used</b>: <em>PHP</em>, <em>HTML</em>, <em>CSS</em>, <em>JavaScript</em>, <em>MySQL</em>.</br>- Creation of a mini <em>ERP</em> system to record and monitor the group's activities.",
    "description_fr": "- Membre et responsable du département technique du groupe Africa-China Business Group.</br>- Développement d’une application web pour les inscriptions des clients pour participer aux divers événements créés par le groupe. <b>Technologie utilisée</b> : <em>PHP</em>, <em>HTML</em>, <em>CSS</em>, <em>JavaScript</em>, <em>MySQL</em>.</br>- Création d’un mini système d’<em>ERP</em> pour pouvoir enregistrer et faire une suivie des activités du groupe."
  },
  {
    "start": "Feb. 2012",
    "start_fr": "Fev. 2012",
    "end": "May 2012",
    "end_fr": "Mai 2012",
    "title": "Software Engineer Internship",
    "title_fr": "Stage Ingénieur Développeur",
    "subtitle": "Minister of National Education, Madagascar",
    "subtitle_fr": "Ministère de l'Éducation Nationale, Madagascar",
    "description": "Creation of a software prototype for the management of the national school sports events in order to digitalize this sector. <b>Technology used</b>: <em>Python</em>, <em>SQLite</em>.",
    "description_fr": "Création d’un prototype de logiciel pour la gestion des sports scolaires dans le but d’informatiser la suivie des activités sportives. <b>Technologie utilisée</b> : <em>Python</em>, <em>SQLite</em>."
  }
]
