[
  {
    "id": 1,
    "start": "March 2021",
    "start_fr": "Mars 2021",
    "end": "Today",
    "end_fr": "Aujourd'hui",
    "title": "ReactJS Developer",
    "title_fr": "Développeur ReactJS",
    "subtitle": "Esokia, Madagascar",
    "subtitle_fr": "Esokia, Madagascar",
    "description": "- Work on a feature that scans a person’s passport in order to login to an app. This app uses machine learning in the back-end to extract the user’s information. <b>Skills</b>: <em>ReactJS</em>, <em>TypeScript</em>, <em>Redux</em>, <em>JWT Auth</em>.<br/>- Creation of a documentation webpage to create some guides for the markets on how to modify the websites and the rules to follow. <b>Skills</b>: <em>ReactJS</em>, <em>SASS</em>, <em>Static Deployment</em>.<br/>- Creation and integration of different themes for several markets using a website developed under Sitecore. <b>Skills</b>: <em>SASS</em>, <em>HTML5</em>, <em>JavaScript</em>, <em>Gulp</em>, <em>CI/CD</em>.<br/>- Responsible for the integration of a Figma mock-up on a website using Magento. <b>Skills</b>: <em>SASS</em>, <em>HTML5</em>, <em>JavaScript</em>, <em>Docker</em>, <em>Redis</em>.<br/>- Maintenance of a widget that manages user logins, registrations and password changes. <b>Skills</b>: <em>VueJS</em>.<br/>- Work in Agile mode within a team of 15 people, using the Azure DevOps tool to organize tasks and using Git flow as a working system.",
    "description_fr": "- Travaillez sur une fonctionnalité où on scanne le passeport d'une personne afin de se connecter à une application. Cette application utilise du Machine Learning dans le back-end pour extraire les informations de l'utilisateur. <b>Compétences</b> : <em>ReactJS</em>, <em>TypeScript</em>, <em>Redux</em>, <em>JWT Auth</em>.<br/>- Création d'une page Web de documentation pour créer des documantations pour les marchés sur la façon de modifier les sites Web et les règles à suivre. <b>Compétences</b> : <em>ReactJS</em>, <em>SASS</em>, <em>Déploiement statique</em>.<br/>- Création et intégration de différents thèmes pour plusieurs marchés utilisant un site web développé sous Sitecore. <b>Compétences</b>: <em>SASS</em>, <em>HTML5</em>, <em>JavaScript</em>, <em>Gulp</em>, <em>CI/CD</em>.<br/>- Responsable de l’intégration d’une maquette Figma sur un site web utilisant Magento. <b>Compétences</b> : <em>SASS</em>, <em>HTML5</em>, <em>JavaScript</em>, <em>Docker</em>, <em>Redis</em>.<br/>- Maintenance d’un widget qui gère les connexions d’utilisateur, les inscriptions et les changements de mots de passes. <b>Compétences</b>: <em>VueJS</em>.<br/>- Travail en mode Agile au sein d’une équipe composé de 15 personnes, en utilisant l’outil Azure DevOps pour organiser les taches et Git flow pour les codes."
  },
  {
    "id": 2,
    "start": "July 2019",
    "start_fr": "Jullet 2019",
    "end": "March 2021",
    "end_fr": "Mars 2021",
    "title": "Web Developer",
    "title_fr": "Développeur Web",
    "subtitle": "Ingenosya, Madagascar",
    "subtitle_fr": "Ingenosya, Madagascar",
    "description": "- Working on a ReactJS admin page that manage adds on videos and also output the metrics of the hits on the ads that pops on the videos that the company streams. <b>Skills</b>: <em>ReactJS</em>, <em>TypeScript</em>, <em>Redux</em>, <em>NodeJS</em>, <em>MongoDB</em>, <em>Redis</em>, <em>Unit Testing</em>, <em>CI/CD Development</em>, <em>Agile System</em>.<br/>- Maintenance of several websites and addition of new functionalities according to customer demand. <b>Skills</b>: <em>PHP</em>, <em>MySQL</em>, <em>HTML5</em>, <em>CSS3</em>, <em>JavaScript</em>, <em>FTP</em>.<br/>- Maintenance of a proprietary framework for the client that helps them create new websites easily according to the company’s themes and policies. <b>Skills</b>: <em>PHP</em>, <em>MySQL</em>, <em>SSH</em>.<br/>- Creation of a script to update the database for a real estate advertising website. <b>Skills</b>: <em>PHP</em>, <em>MySQL</em>, <em>SSH</em>, <em>Crontab</em>.<br/>- Creation of a web and mobile Chat application to engage users who visit a website. <b>Skills</b>: <em>JavaScript</em>, <em>PHP</em>, <em>MySQL</em>, <em>Swift</em>, <em>WebView</em>.",
    "description_fr": "- Travailler sur une page d'administration en ReactJS qui gère les publicités sur les vidéos et produit également les métriques sur les publicités qui apparaissent sur les vidéos diffusées par l'entreprise. <b>Compétences</b> : <em>ReactJS</em>, <em>TypeScript</em>, <em>Redux</em>, <em>NodeJS</em>, <em>MongoDB</em>, <em>Redis</em>, <em>Tests unitaires</em>, <em>Développement CI/CD</em>, <em>Développement Agile</em>.<br/>- Maintenance de plusieurs sites web et ajout de nouvelles fonctionnalités selon la demande des clients. <b>Compétences</b>: <em>PHP</em>, <em>MySQL</em>, <em>HTML5</em>, <em>CSS3</em>, <em>JavaScript</em>, <em>FTP</em>, <em>SSH</em>.<br/>- Maintenance d’un Framework propriétaire au client qui leur aide à créer de nouveaux sites plus facilement et en suivant les thèmes et politique de la compagnie. <b>Compétences</b>: <em>PHP</em>, <em>MySQL</em>.<br/>- Création de script de mise à jour des bases de données pour un site de publicité immobilier. <b>Compétences</b>: <em>PHP</em>, <em>MySQL</em>, <em>SSH</em>, <em>Crontab</em>.<br/>- Création d’une application web et mobile de « Chat » pour interpeller les utilisateurs qui visitent un site web. <b>Compétences</b>: <em>JavaScript</em>, <em>PHP</em>, <em>MySQL</em>, <em>Swift</em>, <em>WebView</em>."
  },
  {
    "id": 3,
    "start": "April 2015",
    "start_fr": "Avril 2015",
    "end": "June 2020",
    "end_fr": "Juin 2020",
    "title": "Full Stack Developer",
    "title_fr": "Développeur Full Stack",
    "subtitle": "Freelance",
    "subtitle_fr": "Freelance",
    "description": "- Design of several websites for different clients in different fields. Working alone most of the time but sometimes I manage a team of 3 people. <b>Skills</b>: <em>ReactJS</em>, <em>TypeScript</em>, <em>VueJS</em>, <em>NuxtJS</em>, <em>HTML5</em>, <em>SASS</em>, <em>CSS3</em>, <em>PHP</em>, <em>MySQL</em>, <em>MongoDB</em>, <em>NodeJS</em>, <em>ExpressJS</em>, <em>JWT Auth</em>, <em>Auth0</em>, <em>AWS</em>, <em>DevOps</em>, <em>CI/CD</em>.<br/>- Creation of hybrid mobile applications with <em>React Native</em>.<br/>- Creation of an 'offline first' web form using a <em>PWA</em>.",
    "description_fr": "- Conception de plusieurs sites web pour différents clients dans différents domaines. Travaillant seul la plupart du temps mais parfois je gère une équipe de 3 personnes. <b>Compétences</b> : <em>AWS</em>, <em>ReactJS</em>, <em>TypeScript</em>, <em>VueJS</em>, NextJS, <em>HTML5</em>, <em>SASS</em>, <em>CSS3</em>, <em>PHP</em>, <em>MySQL</em>, <em>MongoDB</em>, <em>NodeJS</em>, <em>ExpressJS</em>, <em>JWT Auth</em>, <em>Auth0</em>, <em>DevOps</em>, <em>CI/CD</em>.<br/>- La conception d’application mobile hybride avec <em>React Native</em>.<br/>- Création d’un formulaire web 'offline first' en utilisant la technologie <em>PWA</em>."
  },
  {
    "id": 4,
    "start": "Nov. 2016",
    "start_fr": "Nov. 2016",
    "end": "Jan. 2017",
    "end_fr": "Jan. 2017",
    "title": "Web Developer Internship",
    "title_fr": "Stage Développeur Web",
    "subtitle": "Ruanko Company, China",
    "subtitle_fr": "Ruanko Company, Chine",
    "description": "- Participation in the maintenance of an e-commerce site which attracts more than 2000 users per day and learning how to manage performance of a server to serve many users. <b>Skills</b>: <em>Java</em>, <em>CSS3</em>, <em>JavaScript</em>, <em>Bash</em>, <em>Apache Tomcat</em>.<br/>- Optimization of the graphic aspects (UI and UX) of the website. <b>Skills</b>: <em>CSS3</em>, <em>HTML5</em>, <em>JavaScript</em>.<br/>- Creation of a demo product page. <b>Skills</b>: <em>HTML5</em>, <em>CSS3</em>, <em>JavaScript</em>.",
    "description_fr": "- Participation à la maintenance d'un site e-commerce qui attire plus de 2000 utilisateurs par jour et apprentissage de la gestion des performances d'un serveur pour servir de nombreux utilisateurs. <b>Compétences</b> : <em>Java</em>, <em>CSS3</em>, <em>JavaScript</em>, <em>Bash</em>, <em>Apache TomCat</em><br/>- Optimisation des aspects graphiques (UI et UX) du site web. <b>Compétences</b> : <em>CSS3</em>, <em>JavaScript</em>.<br/>- Création d’une page de produit de démo. <b>Compétences</b> : <em>HTML5</em>, <em>CSS3</em>, <em>JavaScript</em>."
  },
  {
    "id": 5,
    "start": "March 2016",
    "start_fr": "Mars 2016",
    "end": "April 2017",
    "end_fr": "Avril 2017",
    "title": "Full Stack Developer",
    "title_fr": "Développeur Full Stack",
    "subtitle": "Wuhan GNLaser Manufacturer, China",
    "subtitle_fr": "Wuhan GNLaser Manufacturer, Chine",
    "description": "- Design of an English version website for the company’s Chinese website to target international market. <b>Skills</b>: <em>PHP</em>, <em>HTML5</em>, <em>CSS3</em>, <em>JavaScript</em>, <em>MySQL</em>.<br/>- Optimization of the website's HTML tags to have more points for SEO purposes in order to increase the visibility of the company.",
    "description_fr": "- Conception d’un site web version anglais pour la compagnie pour leurs clients internationaux. <b>Compétences</b> : <em>PHP</em>, <em>HTML5</em>, <em>CSS3</em>, <em>JavaScript</em>, <em>MySQL</em>.<br/>- Optimisation des balises HTML du site pour avoir plus de points pour le SEO (référencement web) afin d’augmenter la visibilité de la compagnie."
  },
  {
    "id": 6,
    "start": "Feb. 2016",
    "start_fr": "Fev. 2016",
    "end": "March 2018",
    "end_fr": "Mars 2018",
    "title": "Full Stack Developer",
    "title_fr": "Développeur Full Stack",
    "subtitle": "Africa-China Business Group, China",
    "subtitle_fr": "Africa-China Business Group, Chine",
    "description": "- Member and head of the technical department of the Africa-China Business Group.<br/>- Development of a web application for customers to register and participate in the various events created by the group. <b>Skills</b>: <em>PHP</em>, <em>HTML5</em>, <em>CSS3</em>, <em>JavaScript</em>, <em>MySQL</em>.<br/>- Development of a website to attract African Students to go study in China. <b>Skills</b>: <em>PHP</em>, <em>HTML5</em>, <em>CSS3</em>, <em>JavaScript</em>, <em>MySQL</em>.<br/>- Creation of a mini ERP system to record and monitor the group's activities.",
    "description_fr": "- Membre et responsable du département technique du groupe Africa-China Business Group.<br/>- Développement d’une application web pour les inscriptions des clients pour participer aux divers événements créés par le groupe. <b>Compétences</b>: <em>PHP</em>, <em>HTML5</em>, <em>CSS3</em>, <em>JavaScript</em>, <em>MySQL</em>.<br/>- Développement d'un site web pour inciter les étudiants africains à partir étudier en Chine. <b>Compétences</b> : <em>PHP</em>, <em>HTML5</em>, <em>CSS3</em>, <em>JavaScript</em>, <em>MySQL</em><br/>- Création d’un mini système d’ERP pour pouvoir enregistrer et faire une suivie des activités du groupe."
  },
  {
    "id": 7,
    "start": "Feb. 2012",
    "start_fr": "Fev. 2012",
    "end": "May 2012",
    "end_fr": "Mai 2012",
    "title": "Software Engineer Internship",
    "title_fr": "Stage Ingénieur Développeur",
    "subtitle": "Minister of National Education, Madagascar",
    "subtitle_fr": "Ministère de l'Éducation Nationale, Madagascar",
    "description": "Creation of a software prototype for the management of the national school sports events in order to digitalize this sector. <b>Skills</b>: <em>Python</em>, <em>SQLite</em>.",
    "description_fr": "Création d’un prototype de logiciel pour la gestion des sports scolaires dans le but d’informatiser la suivie des activités sportives. <b>Compétences</b> : <em>Python</em>, <em>SQLite</em>."
  }
]
