[
  {
    "id": 1,
    "type": "Contribution",
    "title": "Beachcomber Website Redesign",
    "title_fr": "Refonte Siteweb Beachcomber",
    "url": "www.beachcomber-hotels.com",
    "stack": "NextJS, SASS, Bootstrap , API, Drupal, PM2, Adobe XD, RedMine, Git, Unit testing, Optimization",
    "image": "bch1",
    "thumbnail1": "bch2",
    "thumbnail2": "bch3",
    "thumbnail3": "",
    "description": "I spearheaded the intricate redesign of the hotel's website, orchestrating a seamless transition from the previous Drupal (PHP) platform to the cutting-edge NextJS technology. This ambitious project involved not only the transformation of the website's frontend, enhancing user experience and visual appeal, but also intricately managing the migration and integration of backend functionalities to ensure a unified and optimized digital presence. The successful execution of this endeavor required meticulous planning, technical expertise, and a keen eye for detail, ultimately resulting in an elevated online platform that resonates with modern design and performance standards.",
    "description_fr": "J'ai dirigé la refonte du site web l'hôtel, orchestrant une transition fluide depuis la précédente plateforme Drupal (PHP) vers la technologie de pointe NextJS. Ce projet ambitieux a impliqué non seulement la transformation de la partie frontend du site, améliorant l'expérience utilisateur et l'attrait visuel, mais également la gestion minutieuse de la migration et de l'intégration des fonctionnalités backend pour garantir une présence numérique unifiée et optimisée. L'exécution réussie de cette entreprise a nécessité une planification méticuleuse, une expertise technique et un sens aigu du détail, aboutissant finalement à une plateforme en ligne rehaussée qui s'accorde avec les normes de conception et de performance modernes.",
    "client": "Beachcomber Hotels",
    "country": "Madagascar",
    "country_fr": "Madagascar",
    "employer": "Esokia",
    "key": "beachcomber-hotels"
  },
  {
    "id": 2,
    "type": "Contribution",
    "title": "Hager Group Website",
    "title_fr": "Siteweb Hager Group",
    "url": "www.hager.com",
    "stack": "SASS, HTML5, JavaScript, Magento, Sitecore, VueJS, Gulp, Redis, CI/CD, Docker, Figma, Azure Devops, Git",
    "image": "hager4",
    "thumbnail1": "hager1",
    "thumbnail2": "hager2",
    "thumbnail3": "hager3",
    "description": "I played a significant role in the development of the Hager Group's website, a dynamic e-commerce platform that seamlessly integrates various stores from diverse countries. This multifaceted project demanded not only technical proficiency but also strategic thinking to harmoniously merge the offerings of multiple locations into a cohesive digital shopping experience. Collaborating closely with cross-functional teams, I contributed to the design, development, and implementation phases, ensuring a user-friendly interface, efficient navigation, and secure transaction processes. By facilitating the integration of diverse product ranges and local market preferences, the resulting website effectively caters to a global audience while maintaining a consistent brand identity and optimized user journey.",
    "description_fr": "J'ai joué un rôle significatif dans la création du site web du groupe Hager, une plateforme e-commerce dynamique qui intègre harmonieusement plusieurs boutiques provenant de différents pays. Ce projet complexe a exigé non seulement une compétence technique, mais aussi une réflexion stratégique pour fusionner de manière cohérente les offres de plusieurs localisations en une expérience d'achat numérique unifiée. En collaborant étroitement avec des équipes pluridisciplinaires, j'ai contribué aux phases de conception, de développement et de mise en œuvre, garantissant une interface conviviale, une navigation efficace et des processus de transaction sécurisés. En facilitant l'intégration de gammes de produits variées et de préférences locales du marché, le site résultant répond efficacement à un public mondial tout en préservant une identité de marque cohérente et un parcours utilisateur optimisé.",
    "client": "Hager Group",
    "country": "Madagascar",
    "country_fr": "Madagascar",
    "employer": "Esokia",
    "key": "hager-group"
  },
  {
    "id": 3,
    "type": "Contribution",
    "title": "SupShop",
    "title_fr": "SupShop",
    "url": "www.bexter.fr",
    "stack": "PHP, HTML5, CSS3, JavaScript, MySQL",
    "image": "supshop1",
    "thumbnail1": "supshop2",
    "thumbnail2": "supshop3",
    "thumbnail3": "supshop4",
    "description": "ntegrated directly into your website, the SupShop plugin enables you to set up a Click & Collect service or create a complete Online Store! Home delivery, drive-thru, time slot management, pickup points, inventory management, payment methods including credit cards, checks, bank transfers, PayPal, promotional codes, customer accounts, and statistics are all part of the package",
    "description_fr": "Intégré directement à votre site web, le plug-in SupShop vous permet de mettre en place un service Click & Collect ou créer une véritable Boutique en Ligne! Livraison à domicile, drive, gestion des créneaux horaires,  point relais, gestion des stocks, règlements CB, chèque, virement, PayPal, code promotions, compte clients, statistiques ...",
    "client": "Bexter",
    "country": "Madagascar",
    "country_fr": "Madagascar",
    "employer": "Ingenosya",
    "key": "supshop-bexter"
  },
  {
    "id": 4,
    "type": "Contribution",
    "title": "xChat",
    "title_fr": "xChat",
    "url": "www.bexter.fr",
    "stack": "PHP, HTML5, CSS3, JavaScript, MySQL",
    "image": "xchat3",
    "thumbnail1": "xchat2",
    "thumbnail2": "xchat1",
    "thumbnail3": "",
    "description": "As soon as a user connects to a website equipped with the xChat plugin, a live chat window appears, inviting the visitor to communicate with you. You'll be able to respond to your prospects or clients and assist them in real-time decision-making. Works on all websites in the market.",
    "description_fr": "Dès qu'un internaute se connecte sur un site web équipé du plug in xChat, une fenêtre live chat s'affiche, invitant le visiteur à communiquer avec vous. Vous pourrez répondre à vos prospects ou clients et les assister dans leurs choix en temps réel. Fonctionne sur tous les sites web du marché",
    "client": "Bexter",
    "country": "Madagascar",
    "country_fr": "Madagascar",
    "employer": "Ingenosya",
    "key": "xchat-bexter"
  },
  {
    "id": 5,
    "type": "Contribution",
    "title": "Bexter Website",
    "title_fr": "Siteweb Bexter",
    "url": "www.bexter.fr",
    "stack": "PHP, HTML5, CSS3, JavaScript, MySQL",
    "image": "bex3",
    "thumbnail1": "bex2",
    "thumbnail2": "bex1",
    "thumbnail3": "",
    "description": "I actively participated in the development of Bexter's website, a platform designed to elegantly showcase their diverse range of activities and offerings. This project involved collaborative efforts to craft an engaging online presence that effectively communicates Bexter's mission, services, and achievements. As a key contributor, I played a pivotal role in shaping the website's layout, content structure, and visual elements, ensuring that it resonates with the company's identity and effectively captures the attention of visitors. By leveraging my technical skills and creativity, I contributed to the seamless integration of interactive features, responsive design, and intuitive navigation, resulting in an informative and visually appealing website that accurately reflects Bexter's capabilities and expertise.",
    "description_fr": "J'ai activement contribué à la création du site web de Bexter, une plateforme conçue pour mettre en valeur leur large éventail d'activités et d'offres de manière élégante. Ce projet a impliqué des efforts collaboratifs visant à élaborer une présence en ligne captivante qui communique efficacement la mission, les services et les réalisations de Bexter. En tant que contributeur clé, j'ai joué un rôle essentiel dans la conception de la mise en page du site, la structure du contenu et les éléments visuels, veillant à ce qu'il soit en accord avec l'identité de l'entreprise et attire efficacement l'attention des visiteurs. En utilisant mes compétences techniques et ma créativité, j'ai participé à l'intégration harmonieuse de fonctionnalités interactives, d'un design adaptatif et d'une navigation intuitive, aboutissant à un site web informatif et visuellement attrayant qui reflète fidèlement les compétences et l'expertise de Bexter.",
    "client": "Bexter",
    "country": "Madagascar",
    "country_fr": "Madagascar",
    "employer": "Ingenosya",
    "key": "bexter"
  },
  {
    "id": 6,
    "type": "Contribution",
    "title": "Digiteka Group Admin",
    "title_fr": "Admin Digiteka Group",
    "url": "",
    "stack": "ReactJS, TypeScript, Redux, NodeJS, MongoDB, Redis, Unit Testing, CI/CD",
    "image": "dig5",
    "thumbnail1": "dig4",
    "thumbnail2": "dig3",
    "thumbnail3": "dig1",
    "description": "I played a pivotal role in the development and creation of Digiteka Group's comprehensive Admin panel, a sophisticated platform meticulously designed to effectively manage and optimize video ad revenues and generate insightful reports. This endeavor required a deep understanding of data analytics, user interface design, and backend integration. As a key member of the project team, I actively participated in conceptualizing and implementing features that enable efficient revenue tracking, performance analysis, and customized reporting for the video ad campaigns. Collaborating closely with cross-functional teams, I contributed to crafting a user-friendly interface that empowers users to seamlessly navigate and interact with complex data, ultimately enhancing decision-making processes and driving revenue growth. By leveraging my technical expertise and problem-solving skills, I helped create a robust and intuitive Admin panel that serves as a cornerstone for effective video ad management within the Digiteka Group.",
    "description_fr": "J'ai joué un rôle essentiel dans le développement et la création du panneau d'administration complet du groupe Digiteka, une plateforme sophistiquée minutieusement conçue pour gérer efficacement et optimiser les revenus des publicités vidéo tout en générant des rapports éclairants. Cette entreprise a nécessité une compréhension approfondie de l'analyse des données, de la conception de l'interface utilisateur et de l'intégration côté serveur. En tant que membre clé de l'équipe de projet, j'ai activement participé à la conceptualisation et à la mise en œuvre de fonctionnalités permettant le suivi efficace des revenus, l'analyse des performances et la création de rapports personnalisés pour les campagnes publicitaires vidéo. En collaborant étroitement avec des équipes pluridisciplinaires, j'ai contribué à créer une interface conviviale qui permet aux utilisateurs de naviguer et d'interagir en toute fluidité avec des données complexes, améliorant ainsi les processus de prise de décision et favorisant la croissance des revenus. En mettant à profit mon expertise technique et mes compétences en résolution de problèmes, j'ai contribué à la création d'un panneau d'administration robuste et intuitif qui constitue un pilier essentiel pour la gestion efficace des publicités vidéo au sein du groupe Digiteka.",
    "client": "Digiteka Group",
    "country": "Madagascar",
    "country_fr": "Madagascar",
    "employer": "Ingenosya",
    "key": "digiteka-group"
  },
  {
    "id": 7,
    "type": "Full Stack",
    "title": "ACBG Group Website",
    "title_fr": "Siteweb ACBG Group",
    "url": "",
    "stack": "PHP, HTML5, CSS3, JavaScript, MySQL",
    "image": "acbg4",
    "thumbnail1": "acbg3",
    "thumbnail2": "acbg2",
    "thumbnail3": "acbg1",
    "description": "I undertook the end-to-end development of the ACBG Group's website as a Full Stack project, encompassing both frontend and backend components. The website was strategically designed to serve as a comprehensive platform to highlight the diverse range of activities, conferences, and businesses within the group. Leveraging a wide array of technical skills, I seamlessly integrated dynamic frontend elements to ensure an engaging user experience, while also implementing robust backend functionalities to support content management, data retrieval, and user interaction. By orchestrating the entire development process, from conceptualization and design to coding and deployment, I contributed to the creation of a user-friendly, responsive, and visually appealing website that effectively communicates the group's mission, accomplishments, and offerings to its target audience.",
    "description_fr": "J'ai entrepris la création complète du site web du groupe ACBG en tant que projet Full Stack, englobant à la fois les composantes frontend et backend. Le site web a été conçu de manière stratégique pour servir de plateforme exhaustive visant à mettre en avant la diversité des activités, conférences et entreprises au sein du groupe. En exploitant une large gamme de compétences techniques, j'ai intégré de manière fluide des éléments dynamiques côté frontend afin d'assurer une expérience utilisateur engageante, tout en mettant en place des fonctionnalités backend robustes pour soutenir la gestion du contenu, la récupération des données et l'interaction des utilisateurs. En orchestrant l'intégralité du processus de développement, de la conceptualisation et de la conception à la programmation et au déploiement, j'ai contribué à la création d'un site web convivial, réactif et visuellement attrayant qui communique efficacement la mission, les réalisations et les offres du groupe à son public cible.",
    "client": "Africa China Business Group",
    "country": "China",
    "country_fr": "Chine",
    "employer": "Freelance",
    "key": "acbg-group"
  },
  {
    "id": 8,
    "type": "Full Stack",
    "title": "ACBF Education Website",
    "title_fr": "Siteweb ACBF Education",
    "url": "",
    "stack": "PHP, HTML5, CSS3, JavaScript, MySQL",
    "image": "acbe5",
    "thumbnail1": "acbe4",
    "thumbnail2": "acbe2",
    "thumbnail3": "acbe1",
    "description": "I led the end-to-end development of the ACBF Group Website, taking on the role of a Full Stack developer to bring this project to life. The website serves as a dynamic platform aimed at encouraging African students to pursue higher education opportunities in China. By seamlessly integrating both frontend and backend components, I ensured a cohesive user experience that effectively communicates the benefits of studying in China and provides a seamless registration process directly from the website. Leveraging my technical expertise, I designed and implemented interactive frontend elements to engage visitors and convey information clearly. Additionally, I developed a robust backend system that allows prospective students to easily register for programs and access relevant information. Through this comprehensive Full Stack approach, I contributed to creating a user-friendly and informative website that plays a vital role in facilitating educational opportunities for African students in China.",
    "description_fr": "J'ai dirigé la création complète du site web du groupe ACBF, agissant en tant que développeur Full Stack pour concrétiser ce projet. Le site web sert de plateforme dynamique visant à encourager les étudiants africains à saisir les opportunités d'enseignement supérieur en Chine. En intégrant harmonieusement les composants frontend et backend, j'ai veillé à offrir une expérience utilisateur cohérente qui communique efficacement les avantages d'étudier en Chine et propose un processus d'inscription fluide directement depuis le site web. En mettant à profit mon expertise technique, j'ai conçu et mis en œuvre des éléments interactifs côté frontend pour impliquer les visiteurs et transmettre les informations de manière claire. De plus, j'ai développé un système backend robuste permettant aux futurs étudiants de s'inscrire facilement aux programmes et d'accéder aux informations pertinentes. Grâce à cette approche Full Stack complète, j'ai contribué à la création d'un site web convivial et informatif qui joue un rôle essentiel dans la facilitation des opportunités éducatives pour les étudiants africains en Chine.",
    "client": "Africa China Business Forum",
    "country": "China",
    "country_fr": "Chine",
    "employer": "Freelance",
    "key": "acbf-education"
  },
  {
    "id": 9,
    "type": "Full Stack",
    "title": "Hope International School Website",
    "title_fr": "Siteweb Hope International School",
    "url": "",
    "stack": "PHP, HTML5, CSS3, JavaScript, MySQL",
    "image": "hope5",
    "thumbnail1": "hope4",
    "thumbnail2": "hope3",
    "thumbnail3": "hope2",
    "description": "I undertook the complete Full Stack development of the Hope International School Website, catering to the needs of a Congolese private educational institution. This comprehensive project involved both the frontend and backend aspects, where I seamlessly merged technical expertise with creative design. By integrating interactive frontend components, I aimed to provide an engaging user experience that accurately reflects the school's values and offerings. Simultaneously, I built a robust backend infrastructure to manage and update content efficiently. Through collaborative teamwork and a meticulous attention to detail, I ensured the website's responsiveness across various devices and browsers, enabling seamless access for students, parents, and staff. The end result is a user-friendly and informative online platform that effectively represents the Hope International School and contributes to its online presence within the Congolese education landscape.",
    "description_fr": "J'ai entrepris la création complète en Full Stack du site web de l'École Internationale de l'Espoir, une institution éducative privée congolaise. Ce projet global a englobé à la fois les aspects frontend et backend, où j'ai fusionné avec fluidité l'expertise technique et le design créatif. En intégrant des composants interactifs côté frontend, j'ai cherché à offrir une expérience utilisateur engageante qui reflète fidèlement les valeurs et les offres de l'école. Parallèlement, j'ai construit une infrastructure backend solide pour gérer et mettre à jour le contenu de manière efficiente. Grâce à un travail d'équipe collaboratif et une attention méticuleuse aux détails, j'ai veillé à la réactivité du site web sur divers appareils et navigateurs, permettant un accès fluide aux élèves, aux parents et au personnel. Le résultat final est une plateforme en ligne conviviale et informative qui représente efficacement l'École Internationale de l'Espoir et contribue à sa présence en ligne au sein du paysage éducatif congolais.",
    "client": "Hope International School, Congo",
    "country": "Madagascar",
    "country_fr": "Madagascar",
    "employer": "Freelance",
    "key": "hope-international-school"
  },
  {
    "id": 10,
    "type": "Full Stack",
    "title": "Illo Company Website",
    "title_fr": "Siteweb Illo Company",
    "url": "",
    "stack": "PHP, HTML5, CSS3, JavaScript, MySQL",
    "image": "ill3",
    "thumbnail1": "ill2",
    "thumbnail2": "ill1",
    "thumbnail3": "",
    "description": "I spearheaded the complete Full Stack development of the Illo Company Website, a dynamic landing page designed to showcase the diverse range of activities undertaken by the company. This project encompassed both frontend and backend development, allowing me to seamlessly integrate creative design with technical functionality. By implementing captivating frontend components, I aimed to provide an immersive user experience that effectively communicates the company's offerings and values. Concurrently, I established a robust backend structure to manage and update content efficiently, ensuring the website remains current and informative. Through meticulous attention to detail and rigorous testing, I ensured the website's responsiveness across various devices and browsers, delivering a smooth and engaging browsing experience for visitors. The outcome is a visually appealing and informative online platform that captures the essence of Illo Company's multifaceted endeavors, contributing to the company's online presence and engagement with its audience.",
    "description_fr": "J'ai dirigé la création complète en Full Stack du site web de la société Illo, une page d'accueil dynamique conçue pour présenter la gamme diversifiée d'activités menées par l'entreprise. Ce projet englobait à la fois le développement frontend et backend, me permettant d'intégrer de manière transparente le design créatif à la fonctionnalité technique. En mettant en œuvre des composants captivants côté frontend, j'ai cherché à offrir une expérience utilisateur immersive qui communique efficacement les offres et les valeurs de l'entreprise. Simultanément, j'ai mis en place une structure backend robuste pour gérer et mettre à jour le contenu de manière efficace, garantissant que le site web reste actuel et informatif. Grâce à une attention méticuleuse aux détails et à des tests rigoureux, j'ai assuré la réactivité du site web sur différents appareils et navigateurs, offrant une expérience de navigation fluide et captivante pour les visiteurs. Le résultat est une plateforme en ligne visuellement attrayante et informative qui saisit l'essence des activités variées d'Illo Company, contribuant à la présence en ligne de l'entreprise et à l'interaction avec son public.",
    "client": "Illo Company",
    "country": "China",
    "country_fr": "Chine",
    "employer": "Freelance",
    "key": "illo-company"
  },
  {
    "id": 11,
    "type": "Full Stack",
    "title": "CUAS China Website",
    "title_fr": "Siteweb CUAS China",
    "url": "",
    "stack": "PHP, HTML5, CSS3, JavaScript, MySQL",
    "image": "cua3",
    "thumbnail1": "cua2",
    "thumbnail2": "cua1",
    "thumbnail3": "",
    "description": "I led the comprehensive Full Stack development of the CUAS China Website, a platform designed to highlight various scholarship opportunities offered by Chinese universities to African students. This multifaceted project encompassed both frontend and backend development, allowing me to seamlessly integrate innovative design with robust technical functionality. Through captivating frontend elements, I aimed to create an immersive user experience that effectively communicated the range of scholarship options available and streamlined the application process for African students. Simultaneously, I established a dynamic backend infrastructure to facilitate efficient content management, ensuring the website remains current and informative. With meticulous attention to detail and rigorous testing, I ensured the website's responsiveness across diverse devices and browsers, ensuring a seamless and engaging browsing experience for potential scholarship applicants. The outcome is a user-friendly and informative online platform that bridges the gap between African students and valuable scholarship opportunities provided by Chinese universities, fostering educational opportunities and cross-cultural exchange.",
    "description_fr": "J'ai dirigé la création complète en Full Stack du site web de la CUAS China, une plateforme conçue pour mettre en avant diverses opportunités de bourses offertes par des universités chinoises aux étudiants africains. Ce projet polyvalent englobait à la fois le développement frontend et backend, me permettant d'intégrer de manière transparente un design innovant à une fonctionnalité technique robuste. Grâce à des éléments captivants côté frontend, j'ai cherché à créer une expérience utilisateur immersive qui communique efficacement la gamme d'options de bourses disponibles et simplifie le processus de candidature pour les étudiants africains. Simultanément, j'ai établi une infrastructure backend dynamique pour faciliter la gestion efficace du contenu, garantissant que le site web reste actuel et informatif. Grâce à une attention méticuleuse aux détails et à des tests rigoureux, j'ai assuré la réactivité du site web sur différents appareils et navigateurs, garantissant une expérience de navigation fluide et engageante pour les potentiels candidats aux bourses. Le résultat est une plateforme en ligne conviviale et informative qui comble le fossé entre les étudiants africains et les précieuses opportunités de bourses offertes par les universités chinoises, favorisant les opportunités éducatives et les échanges interculturels.",
    "client": "Illo Company",
    "country": "China",
    "country_fr": "Chine",
    "employer": "Freelance",
    "key": "cuas-china"
  },
  {
    "id": 12,
    "type": "Full Stack",
    "title": "Eskimmo Website",
    "title_fr": "Siteweb Eskimmo",
    "url": "",
    "stack": "PHP, HTML5, CSS3, JavaScript, MySQL",
    "image": "esk3",
    "thumbnail1": "esk2",
    "thumbnail2": "esk1",
    "thumbnail3": "",
    "description": "I took the lead in the complete Full Stack development of the Eskimmo Website, a dynamic real estate platform managed by Illo company. This project involved not only the creation of an intuitive and visually appealing frontend interface but also the establishment of a robust backend infrastructure to support a seamless property search and listing experience. Through strategic implementation of advanced search filters, interactive maps, and user-friendly navigation, I aimed to provide users with an efficient and engaging way to explore property listings. Additionally, I integrated secure user authentication and a comprehensive property management system for administrators, enabling efficient property listings management and updates. With meticulous attention to user experience, responsive design, and performance optimization, I ensured that the website effectively catered to the needs of both potential property buyers and the Illo company's management. The outcome is a user-friendly, feature-rich real estate platform that enhances property search and showcases the offerings of the Illo company.",
    "description_fr": "J'ai pris les rênes du développement complet en Full Stack du site web Eskimmo, une plateforme immobilière dynamique gérée par la société Illo. Ce projet a impliqué non seulement la création d'une interface frontend intuitive et visuellement attrayante, mais aussi l'établissement d'une infrastructure backend robuste pour soutenir une expérience de recherche et de listing de biens immobiliers fluide. Grâce à la mise en œuvre stratégique de filtres de recherche avancés, de cartes interactives et d'une navigation conviviale, j'ai cherché à offrir aux utilisateurs un moyen efficace et engageant d'explorer les listes de biens immobiliers. De plus, j'ai intégré une authentification sécurisée des utilisateurs et un système complet de gestion des biens pour les administrateurs, permettant une gestion et une mise à jour efficaces des listes de biens. Avec une attention méticuleuse portée à l'expérience utilisateur, au design adaptatif et à l'optimisation des performances, j'ai veillé à ce que le site web réponde efficacement aux besoins à la fois des potentiels acheteurs de biens immobiliers et de la direction de la société Illo. Le résultat est une plateforme immobilière conviviale et riche en fonctionnalités qui améliore la recherche de biens immobiliers et met en valeur les offres de la société Illo.",
    "client": "Illo Company",
    "country": "China",
    "country_fr": "Chine",
    "employer": "Freelance",
    "key": "eskimmo"
  },
  {
    "id": 13,
    "type": "Full Stack",
    "title": "BM Cargo Website",
    "title_fr": "Siteweb BM Cargo",
    "url": "",
    "stack": "PHP, HTML5, CSS3, JavaScript, MySQL",
    "image": "bm2",
    "thumbnail1": "bm1",
    "thumbnail2": "bm3",
    "thumbnail3": "",
    "description": "I spearheaded the end-to-end development of the BM Cargo Website, a comprehensive import-export platform managed by Illo Company. This endeavor encompassed the design and implementation of both frontend and backend components to ensure a seamless user experience for individuals and businesses engaged in international trade. Through meticulous UI/UX design, responsive layout development, and integration of user-friendly functionalities, I aimed to facilitate the process of managing imports and exports. The website featured tools for tracking shipments, managing documentation, calculating shipping costs, and communicating with clients and partners. Additionally, I incorporated secure payment gateways and authentication systems to enhance security and user trust. With a focus on scalability, performance optimization, and intuitive navigation, I delivered a powerful online platform that streamlines global trade operations for Illo Company and its clients.",
    "description_fr": "J'ai pris en charge le développement complet en Full Stack du site web BM Cargo, une plateforme complète d'import-export gérée par la société Illo. Cette entreprise a englobé la conception et la mise en œuvre des composants frontend et backend afin de garantir une expérience utilisateur fluide pour les particuliers et les entreprises engagés dans le commerce international. Grâce à une conception méticuleuse de l'interface utilisateur, au développement d'une mise en page adaptative et à l'intégration de fonctionnalités conviviales, j'ai visé à faciliter le processus de gestion des importations et des exportations. Le site web proposait des outils pour suivre les expéditions, gérer la documentation, calculer les coûts d'expédition et communiquer avec les clients et les partenaires. De plus, j'ai intégré des passerelles de paiement sécurisées et des systèmes d'authentification pour renforcer la sécurité et la confiance des utilisateurs. Axé sur la scalabilité, l'optimisation des performances et la navigation intuitive, j'ai livré une plateforme en ligne puissante qui rationalise les opérations de commerce mondial pour la société Illo et ses clients.",
    "client": "Illo Company",
    "country": "China",
    "country_fr": "Chine",
    "employer": "Freelance",
    "key": "bm-cargo"
  },
  {
    "id": 14,
    "type": "Full Stack",
    "title": "La Frontière Website",
    "title_fr": "Siteweb La Frontière",
    "url": "",
    "stack": "PHP, HTML5, CSS3, JavaScript, MySQL",
    "image": "laf4",
    "thumbnail1": "laf3",
    "thumbnail2": "laf2",
    "thumbnail3": "laf1",
    "description": "I led the end-to-end development of the La Frontière Website, a compact e-commerce platform catering to the Ivory Coast market, under the operation of Illo Company. This project encompassed the design, coding, and deployment of both frontend and backend components to establish a user-friendly and efficient online shopping experience for the local audience. Employing responsive design principles, intuitive navigation, and secure payment gateways, I aimed to create a seamless process for customers to browse products, place orders, and complete transactions. Furthermore, I integrated inventory management, order tracking, and customer support functionalities to enhance the overall user satisfaction and streamline business operations. By ensuring a robust and scalable architecture, I delivered a well-crafted digital platform that contributes to Illo Company's commitment to serving the Ivory Coast market with quality products and services.",
    "description_fr": "J'ai dirigé la création en Full Stack du site web La Frontière, une plateforme de commerce électronique compacte destinée au marché ivoirien, gérée par la société Illo. Ce projet englobait la conception, la programmation et le déploiement des composants frontend et backend afin de créer une expérience de shopping en ligne conviviale et efficace pour le public local. En utilisant des principes de conception réactive, une navigation intuitive et des passerelles de paiement sécurisées, j'ai cherché à créer un processus fluide permettant aux clients de parcourir les produits, de passer des commandes et de finaliser les transactions. De plus, j'ai intégré la gestion des stocks, le suivi des commandes et les fonctionnalités de support client pour améliorer la satisfaction globale des utilisateurs et rationaliser les opérations commerciales. En garantissant une architecture solide et évolutive, j'ai livré une plateforme numérique bien conçue qui contribue à l'engagement d'Illo Company à servir le marché ivoirien avec des produits et des services de qualité.",
    "client": "Illo Company",
    "country": "China",
    "country_fr": "Chine",
    "employer": "Freelance",
    "key": "la-frontiere"
  },
  {
    "id": 15,
    "type": "Full Stack",
    "title": "GNLaser Website",
    "title_fr": "Siteweb GNLaser",
    "url": "",
    "stack": "PHP, HTML5, CSS3, JavaScript, MySQL",
    "image": "gn4",
    "thumbnail1": "gn3",
    "thumbnail2": "gn2",
    "thumbnail3": "gn1",
    "description": "I undertook the complete Full Stack development of the GNLaser Website, a platform dedicated to showcasing Chinese laser cutting machines to the global market. As part of this project, I assumed responsibility for both the frontend and backend development, ensuring a seamless and engaging user experience. The website's architecture was designed to effectively present the technical specifications, features, and benefits of the laser cutting machines, targeting an international audience. Leveraging my expertise in Search Engine Optimization (SEO), I optimized the content and structure of the website to enhance its visibility on search engines and reach a wider range of potential customers. Through intuitive navigation, captivating visuals, and strategic placement of keywords, I aimed to attract and engage visitors, fostering a strong online presence for GNLaser in the competitive market. This endeavor reflects my commitment to creating functional and impactful digital solutions that align with business objectives.",
    "description_fr": "J'ai entrepris la création complète en Full Stack du site web GNLaser, une plateforme dédiée à la présentation des machines de découpe au laser chinoises sur le marché mondial. Dans le cadre de ce projet, j'ai assumé la responsabilité du développement à la fois du frontend et du backend, garantissant une expérience utilisateur fluide et captivante. L'architecture du site web a été conçue pour présenter efficacement les spécifications techniques, les fonctionnalités et les avantages des machines de découpe au laser, en ciblant un public international. En exploitant mon expertise en matière de référencement (SEO), j'ai optimisé le contenu et la structure du site web pour améliorer sa visibilité sur les moteurs de recherche et toucher un public plus large de clients potentiels. Grâce à une navigation intuitive, des visuels captivants et un placement stratégique de mots-clés, j'ai cherché à attirer et à impliquer les visiteurs, favorisant une forte présence en ligne pour GNLaser sur le marché concurrentiel. Cette initiative reflète mon engagement à créer des solutions numériques fonctionnelles et impactantes en harmonie avec les objectifs commerciaux.",
    "client": "Wuhan GNLaser Manufacturer",
    "country": "China",
    "country_fr": "Chine",
    "employer": "Freelance",
    "key": "gnlaser"
  },
  {
    "id": 16,
    "type": "Full Stack",
    "title": "DMDMade Website",
    "title_fr": "Siteweb DMDMade",
    "url": "",
    "stack": "PHP, HTML5, CSS3, JavaScript, MySQL",
    "image": "dmd4",
    "thumbnail1": "dmd3",
    "thumbnail2": "dmd2",
    "thumbnail3": "dmd1",
    "description": "I was responsible for the end-to-end development of the DMDMade Website, a dynamic music streaming platform that primarily features music produced by the talented artist and designer DMD from Benin. This project encompassed the creation of both the frontend and backend components, aiming to provide users with an immersive and user-friendly experience. The website was designed to showcase DMD's unique music style, allowing users to easily browse, discover, and enjoy his creations. Implementing audio streaming capabilities, user authentication, and a well-organized database, I ensured smooth playback and accessibility to the extensive music catalog. With a focus on aesthetics and usability, the user interface was thoughtfully designed to engage visitors and facilitate seamless navigation. By successfully combining artistic vision with technical prowess, the DMDMade Website serves as a hub for music enthusiasts to connect with DMD's exceptional creations and immerse themselves in the world of music from Benin.",
    "description_fr": "J'ai été chargé de la création complète du site web DMDMade, une plateforme dynamique de streaming musical mettant principalement en avant la musique produite par l'artiste et designer talentueux DMD du Bénin. Ce projet englobait la création des composantes frontend et backend, dans le but de fournir aux utilisateurs une expérience immersive et conviviale. Le site web a été conçu pour mettre en valeur le style musical unique de DMD, permettant aux utilisateurs de parcourir, découvrir et apprécier facilement ses créations. En mettant en œuvre des capacités de streaming audio, une authentification utilisateur et une base de données bien organisée, j'ai veillé à une lecture fluide et à l'accessibilité au vaste catalogue musical. Avec un accent sur l'esthétique et l'utilisabilité, l'interface utilisateur a été pensée pour engager les visiteurs et faciliter une navigation fluide. En combinant avec succès la vision artistique et l'expertise technique, le site web DMDMade sert de plateforme permettant aux amateurs de musique de se connecter avec les créations exceptionnelles de DMD et de plonger dans l'univers musical du Bénin.",
    "client": "DMDMade",
    "country": "China",
    "country_fr": "Chine",
    "employer": "Freelance",
    "key": "dmdmade"
  },
  {
    "id": 17,
    "type": "Full Stack",
    "title": "Osaka Expat Bar Website",
    "title_fr": "Siteweb Osaka Expat Bar",
    "url": "",
    "stack": "PHP, HTML5, CSS3, JavaScript, MySQL",
    "image": "bar3",
    "thumbnail1": "bar2",
    "thumbnail2": "bar1",
    "thumbnail3": "",
    "description": "I led the end-to-end development of the Osaka Expat Bar Website, a comprehensive platform tailored to showcase the bar's enticing drink menu and highlight their exciting lineup of upcoming events. This project encompassed both frontend and backend components, aimed at delivering a seamless and engaging experience for users. The website was meticulously designed to reflect the bar's vibrant atmosphere, allowing patrons to easily explore the diverse range of beverages on offer. With user-friendly navigation, intuitive filtering options, and captivating visuals, I ensured that visitors could effortlessly discover their preferred drinks. Additionally, the website incorporated an events section where users could stay informed about the latest gatherings, live music performances, and special occasions hosted by the bar. By integrating interactive features, user authentication, and robust backend functionalities, I established a digital hub that seamlessly connects patrons with the Osaka Expat Bar's unique offerings. This creation not only enhances the bar's online presence but also enriches the overall experience for those seeking great drinks and memorable nights out.",
    "description_fr": "J'ai dirigé la création intégrale du site web d'Osaka Expat Bar, une plateforme complète conçue pour mettre en avant le menu de boissons attrayant du bar et présenter leur programmation passionnante d'événements à venir. Ce projet englobait à la fois les composantes frontend et backend, dans le but de fournir aux utilisateurs une expérience fluide et engageante. Le site web a été soigneusement conçu pour refléter l'ambiance vibrante du bar, permettant aux clients d'explorer facilement la gamme diversifiée de boissons proposées. Avec une navigation conviviale, des options de filtrage intuitives et des visuels captivants, j'ai veillé à ce que les visiteurs puissent découvrir sans effort leurs boissons préférées. De plus, le site web incluait une section dédiée aux événements où les utilisateurs pouvaient rester informés des derniers rassemblements, des performances de musique live et des occasions spéciales organisées par le bar. En intégrant des fonctionnalités interactives, une authentification utilisateur et des fonctionnalités backend robustes, j'ai créé un hub numérique qui connecte de manière transparente les clients aux offres uniques d'Osaka Expat Bar. Cette création améliore non seulement la présence en ligne du bar, mais enrichit également l'expérience globale de ceux qui recherchent de délicieuses boissons et des soirées mémorables.",
    "client": "Osaka Expat Bar, Japan",
    "country": "Madagascar",
    "country_fr": "Madagascar",
    "employer": "Freelance",
    "key": "osaka-expat-bar"
  },
  {
    "id": 18,
    "type": "Full Stack",
    "title": "Incubated In China Website",
    "title_fr": "Siteweb Incubated In China",
    "url": "",
    "stack": "PHP, HTML5, CSS3, JavaScript, MySQL",
    "image": "incu4",
    "thumbnail1": "incu3",
    "thumbnail2": "incu2",
    "thumbnail3": "incu1",
    "description": "I undertook the end-to-end development of the Incubated In China Website, a comprehensive online platform dedicated to showcasing the book \"Incubated In China,\" authored by Shubila Ruth. This project encompassed both frontend and backend components, aimed at creating a dynamic digital space to promote and engage readers with the book's content. The website was thoughtfully designed to capture the essence of the book's themes and narrative, providing visitors with an immersive and informative experience. I incorporated user-friendly navigation, visually appealing layouts, and interactive features that allow readers to delve into the book's insights and stories. The website also facilitated easy access to purchase the book, providing a seamless e-commerce experience for interested readers. With careful attention to detail, I ensured that the website's design and functionalities aligned with the essence of \"Incubated In China,\" enabling readers to connect with the author's journey and perspective. By integrating engaging visuals, responsive design, and secure e-commerce capabilities, I successfully created a digital hub that enhances the reach and impact of the book \"Incubated In China.\"",
    "description_fr": "J'ai entrepris la création intégrale du site web Incubated In China, une plateforme en ligne complète dédiée à la promotion du livre \"Incubated In China\", écrit par Shubila Ruth. Ce projet englobait à la fois les composantes frontend et backend, dans le but de créer un espace numérique dynamique pour promouvoir et engager les lecteurs avec le contenu du livre. Le site web a été soigneusement conçu pour capturer l'essence des thèmes et de la narration du livre, offrant aux visiteurs une expérience immersive et informative. J'ai intégré une navigation conviviale, des mises en page visuellement attrayantes et des fonctionnalités interactives qui permettent aux lecteurs d'explorer les idées et les histoires du livre. Le site web a également facilité l'accès à l'achat du livre, offrant une expérience d'e-commerce fluide pour les lecteurs intéressés. En accordant une attention particulière aux détails, j'ai veillé à ce que la conception et les fonctionnalités du site web soient en harmonie avec l'essence d' \"Incubated In China\", permettant aux lecteurs de se connecter au parcours et à la perspective de l'auteure. En intégrant des visuels captivants, un design réactif et des capacités d'e-commerce sécurisées, j'ai créé avec succès un hub numérique qui renforce la portée et l'impact du livre \"Incubated In China\".",
    "client": "Shubilla Ruth",
    "country": "China",
    "country_fr": "Chine",
    "employer": "Freelance",
    "key": "incubated-in-china"
  },
  {
    "id": 19,
    "type": "Full Stack",
    "title": "Multibridge Global Website",
    "title_fr": "Siteweb Multibridge Global",
    "url": "",
    "stack": "PHP, HTML5, CSS3, JavaScript, MySQL",
    "image": "nana4",
    "thumbnail1": "nana3",
    "thumbnail2": "nana2",
    "thumbnail3": "nana1",
    "description": "I undertook the complete Full Stack development of the Multibridge Global Website, an innovative platform dedicated to facilitating import and export operations, particularly focused on exporting goods from China. This project encompassed both frontend and backend development, aiming to provide a comprehensive digital solution for businesses engaged in international trade. The website was designed with a user-friendly interface, enabling seamless navigation and efficient access to information about the products and services offered. On the frontend, I implemented captivating visuals and intuitive layouts to enhance the user experience and engagement. On the backend, I integrated robust functionalities that enable users to explore the catalog of products, place orders, and manage their trade operations effectively. Additionally, the website included features to highlight the value proposition of Multibridge Global, emphasizing their expertise in bridging international trade gaps. By creating an efficient and user-friendly platform that connects exporters and importers, I contributed to optimizing global trade operations and fostering international business relationships.",
    "description_fr": "J'ai entrepris la création complète en Full Stack du site web Multibridge Global, une plateforme innovante dédiée à faciliter les opérations d'import-export, avec un accent particulier sur l'exportation de marchandises depuis la Chine. Ce projet englobait le développement à la fois du frontend et du backend, dans le but de fournir une solution numérique complète pour les entreprises impliquées dans le commerce international. Le site web a été conçu avec une interface conviviale, permettant une navigation fluide et un accès efficace aux informations sur les produits et les services proposés. Sur le frontend, j'ai mis en place des visuels captivants et des mises en page intuitives pour améliorer l'expérience utilisateur et l'engagement. Sur le backend, j'ai intégré des fonctionnalités robustes permettant aux utilisateurs d'explorer le catalogue de produits, de passer des commandes et de gérer efficacement leurs opérations commerciales. De plus, le site web comprenait des fonctionnalités pour mettre en avant la proposition de valeur de Multibridge Global, en mettant l'accent sur leur expertise dans le comblement des écarts du commerce international. En créant une plateforme efficace et conviviale qui connecte les exportateurs et les importateurs, j'ai contribué à optimiser les opérations commerciales mondiales et à favoriser les relations commerciales internationales.",
    "client": "Multibridge Global",
    "country": "China",
    "country_fr": "Chine",
    "employer": "Freelance",
    "key": "multibridge-global"
  },
  {
    "id": 20,
    "type": "Full Stack",
    "title": "WomenZaiYiqi Website",
    "title_fr": "Siteweb WomenZaiYiqi",
    "url": "",
    "stack": "PHP, HTML5, CSS3, JavaScript, MySQL",
    "image": "women5",
    "thumbnail1": "women4",
    "thumbnail2": "women2",
    "thumbnail3": "women1",
    "description": "I undertook the comprehensive Full Stack development of the WomenZaiYiqi Website, a dynamic online platform focused on import and export operations, specializing in the sale of wood products and investment opportunities in the Congo. This project encompassed both frontend and backend development, with the goal of providing a seamless digital experience for businesses and individuals interested in the wood industry and investment ventures. On the frontend, I designed an engaging and user-friendly interface that effectively showcases the diverse range of wood products and investment offerings. The website features intuitive navigation, allowing users to explore product details, pricing, and investment opportunities with ease. On the backend, I integrated robust functionalities for inventory management, order processing, and secure online transactions. Additionally, I implemented features that highlight the sustainability practices and environmental consciousness of WomenZaiYiqi, contributing to their brand identity and positioning in the market. By creating a sophisticated platform that caters to the import/export and investment needs of the wood industry, I played a pivotal role in enhancing WomenZaiYiqi's online presence and facilitating their business growth.",
    "description_fr": "J'ai entrepris la création complète en Full Stack du site web WomenZaiYiqi, une plateforme en ligne dynamique axée sur les opérations d'import-export, spécialisée dans la vente de produits en bois et les opportunités d'investissement au Congo. Ce projet englobait le développement à la fois du frontend et du backend, dans le but de fournir une expérience numérique fluide pour les entreprises et les particuliers intéressés par l'industrie du bois et les investissements. Sur le frontend, j'ai conçu une interface attrayante et conviviale qui met en valeur la gamme diversifiée de produits en bois et les offres d'investissement. Le site web offre une navigation intuitive, permettant aux utilisateurs d'explorer les détails des produits, les prix et les opportunités d'investissement avec facilité. Sur le backend, j'ai intégré des fonctionnalités robustes pour la gestion des stocks, le traitement des commandes et les transactions en ligne sécurisées. De plus, j'ai mis en place des fonctionnalités qui mettent en avant les pratiques durables et la conscience environnementale de WomenZaiYiqi, contribuant à leur identité de marque et à leur positionnement sur le marché. En créant une plateforme sophistiquée répondant aux besoins d'import-export et d'investissement de l'industrie du bois, j'ai joué un rôle essentiel dans l'amélioration de la présence en ligne de WomenZaiYiqi et la facilitation de leur croissance commerciale.",
    "client": "WomenZaiYiqi",
    "country": "China",
    "country_fr": "Chine",
    "employer": "Freelance",
    "key": "womenzaiyiqi"
  },
  {
    "id": 21,
    "type": "Full Stack",
    "title": "Milk Hills Puppies Website",
    "title_fr": "Siteweb Milk Hills Puppies",
    "url": "",
    "stack": "PHP, HTML5, CSS3, JavaScript, MySQL",
    "image": "pup3",
    "thumbnail1": "pup2",
    "thumbnail2": "pup1",
    "thumbnail3": "",
    "description": "I undertook the comprehensive Full Stack development of the Milk Hills Puppies Website, a dynamic online platform dedicated to the sale of puppies. This project involved the creation of both frontend and backend components, with the aim of providing a user-friendly and informative experience for individuals interested in purchasing puppies as pets. On the frontend, I designed an engaging and visually appealing interface that showcases various breeds of puppies available for sale. The website features detailed profiles of each puppy, including information about their breed, age, temperament, and care requirements. Users can easily navigate through the listings, view high-quality images, and access essential details to help them make informed decisions. On the backend, I implemented functionalities for managing puppy listings, enabling secure online transactions, and facilitating communication between potential buyers and sellers. By creating a sophisticated platform that connects puppy enthusiasts with their future furry companions, I contributed to the growth of Milk Hills Puppies and provided a valuable resource for individuals seeking to add a new member to their family.",
    "description_fr": "J'ai entrepris la création complète en Full Stack du site web Milk Hills Puppies, une plateforme en ligne dynamique dédiée à la vente de chiots. Ce projet a impliqué la création à la fois des composants frontend et backend, dans le but de fournir une expérience conviviale et informative aux personnes intéressées par l'achat de chiots comme animaux de compagnie. Sur le frontend, j'ai conçu une interface attrayante et visuellement plaisante qui met en valeur différentes races de chiots disponibles à la vente. Le site web présente des profils détaillés de chaque chiot, comprenant des informations sur leur race, leur âge, leur tempérament et leurs besoins en matière de soins. Les utilisateurs peuvent naviguer facilement à travers les annonces, visualiser des images de haute qualité et accéder à des détails essentiels pour les aider à prendre des décisions éclairées. Sur le backend, j'ai mis en place des fonctionnalités pour gérer les annonces de chiots, permettre des transactions en ligne sécurisées et faciliter la communication entre les acheteurs potentiels et les vendeurs. En créant une plateforme sophistiquée qui relie les passionnés de chiots à leurs futurs compagnons à quatre pattes, j'ai contribué à la croissance de Milk Hills Puppies et fourni une ressource précieuse pour les personnes souhaitant ajouter un nouveau membre à leur famille.",
    "client": "Milk Hills Puppies",
    "country": "Madagascar",
    "country_fr": "Madagascar",
    "employer": "Freelance",
    "key": "milk-hills-puppies"
  }
]
